{
  "speeches" : [
    {
      "author": "Martin Luther King Jr",
      "speech": "I am happy to join with you today in what will go down in history as the greatest demonstration for freedom in the history of our nation.\n\nFive score years ago, a great American, in whose symbolic shadow we stand today, signed the Emancipation Proclamation. This momentous decree came as a great beacon of hope to millions of slaves, who had been seared in the flames of whithering injustice. It came as a joyous daybreak to end the long night of their captivity. But one hundred years later, the colored America is still not free. One hundred years later, the life of the colored American is still sadly crippled by the manacle of segregation and the chains of discrimination.\n\nOne hundred years later, the colored American lives on a lonely island of poverty in the midst of a vast ocean of material prosperity. One hundred years later, the colored American is still languishing in the corners of American society and finds himself an exile in his own land So we have come here today to dramatize a shameful condition.\n\nIn a sense we have come to our Nation’s Capital to cash a check. When the architects of our great republic wrote the magnificent words of the Constitution and the Declaration of Independence, they were signing a promissory note to which every American was to fall heir.\n\nThis note was a promise that all men, yes, black men as well as white men, would be guaranteed the inalienable rights of life liberty and the pursuit of happiness.\n\nIt is obvious today that America has defaulted on this promissory note insofar as her citizens of color are concerned. Instead of honoring this sacred obligation, America has given its colored people a bad check, a check that has come back marked “insufficient funds.”\n\nBut we refuse to believe that the bank of justice is bankrupt. We refuse to believe that there are insufficient funds in the great vaults of opportunity of this nation. So we have come to cash this check, a check that will give us upon demand the riches of freedom and security of justice.\n\nWe have also come to his hallowed spot to remind America of the fierce urgency of Now. This is not time to engage in the luxury of cooling off or to take the tranquilizing drug of gradualism.\n\nNow is the time to make real the promise of democracy.\n\nNow it the time to rise from the dark and desolate valley of segregation to the sunlit path of racial justice.\n\nNow it the time to lift our nation from the quicksand of racial injustice to the solid rock of brotherhood.\n\nNow is the time to make justice a reality to all of God’s children.\n\nI would be fatal for the nation to overlook the urgency of the moment and to underestimate the determination of it’s colored citizens. This sweltering summer of the colored people’s legitimate discontent will not pass until there is an invigorating autumn of freedom and equality. Nineteen sixty-three is not an end but a beginning. Those who hope that the colored Americans needed to blow off steam and will now be content will have a rude awakening if the nation returns to business as usual.\n\nThere will be neither rest nor tranquility in America until the colored citizen is granted his citizenship rights. The whirlwinds of revolt will continue to shake the foundations of our nation until the bright day of justice emerges.\n\nWe can never be satisfied as long as our bodies, heavy with the fatigue of travel, cannot gain lodging in the motels of the highways and the hotels of the cities.\n\nWe cannot be satisfied as long as the colored person’s basic mobility is from a smaller ghetto to a larger one.\n\nWe can never be satisfied as long as our children are stripped of their selfhood and robbed of their dignity by signs stating “for white only.”\n\nWe cannot be satisfied as long as a colored person in Mississippi cannot vote and a colored person in New York believes he has nothing for which to vote.\n\nNo, no we are not satisfied and we will not be satisfied until justice rolls down like waters and righteousness like a mighty stream.\n\nI am not unmindful that some of you have come here out of your trials and tribulations. Some of you have come from areas where your quest for freedom left you battered by storms of persecutions and staggered by the winds of police brutality.\n\nYou have been the veterans of creative suffering. Continue to work with the faith that unearned suffering is redemptive.\n\nGo back to Mississippi, go back to Alabama, go back to South Carolina go back to Georgia, go back to Louisiana, go back to the slums and ghettos of our modern cities, knowing that somehow this situation can and will be changed.\n\nLet us not wallow in the valley of despair. I say to you, my friends, we have the difficulties of today and tomorrow.\n\nI still have a dream. It is a dream deeply rooted in the American dream.\n\nI have a dream that one day this nation will rise up and live out the true meaning of its creed. We hold these truths to be self-evident that all men are created equal.\n\nI have a dream that one day out in the red hills of Georgia the sons of former slaves and the sons of former slaveowners will be able to sit down together at the table of brotherhood.\n\nI have a dream that one day even the state of Mississippi, a state sweltering with the heat of oppression, will be transformed into an oasis of freedom and justice.\n\nI have a dream that my four little children will one day live in a nation where they will not be judged by the color of their skin but by their character.\n\nI have a dream today.\n\nI have a dream that one day down in Alabama, with its vicious racists, with its governor having his lips dripping with the words of interposition and nullification; that one day right down in Alabama little black boys and black girls will be able to join hands with little white boys and white girls as sisters and brothers.\n\nI have a dream today.\n\nI have a dream that one day every valley shall be engulfed, every hill shall be exalted and every mountain shall be made low, the rough places will be made plains and the crooked places will be made straight and the glory of the Lord shall be revealed and all flesh shall see it together.\n\nThis is our hope. This is the faith that I will go back to the South with. With this faith we will be able to hew out of the mountain of despair a stone of hope.\n\nWith this faith we will be able to transform the jangling discords of our nation into a beautiful symphony of brotherhood.\n\nWith this faith we will be able to work together, to pray together, to struggle together, to go to jail together, to climb up for freedom together, knowing that we will be free one day.\n\nThis will be the day when all of God’s children will be able to sing with new meaning “My country ’tis of thee, sweet land of liberty, of thee I sing. Land where my father’s died, land of the Pilgrim’s pride, from every mountainside, let freedom ring!”\n\nAnd if America is to be a great nation, this must become true. So let freedom ring from the hilltops of New Hampshire. Let freedom ring from the mighty mountains of New York.\n\nLet freedom ring from the heightening Alleghenies of Pennsylvania.\n\nLet freedom ring from the snow-capped Rockies of Colorado.\n\nLet freedom ring from the curvaceous slopes of California.\n\nBut not only that, let freedom, ring from Stone Mountain of Georgia.\n\nLet freedom ring from every hill and molehill of Mississippi and every mountainside.\n\nWhen we let freedom ring, when we let it ring from every tenement and every hamlet, from every state and every city, we will be able to speed up that day when all of God’s children, black men and white men, Jews and Gentiles, Protestants and Catholics, will be able to join hands and sing in the words of the old spiritual, “Free at last, free at last. Thank God Almighty, we are free at last.”",
      "keywords": "america civil rights equality freedom",
      "date": "1963-08-28T14:45:15"
    },
    {
      "author": "Carlos P. Romulo",
      "speech": "I am a Filipino–inheritor of a glorious past, hostage to the uncertain future. As such I must prove equal to a two-fold task–the task of meeting my responsibility to the past, and the task of performing my obligation to the future.\n\nI sprung from a hardy race, child many generations removed of ancient Malayan pioneers. Across the centuries the memory comes rushing back to me: of brown-skinned men putting out to sea in ships that were as frail as their hearts were stout. Over the sea I see them come, borne upon the billowing wave and the whistling wind, carried upon the mighty swell of hope–hope in the free abundance of new land that was to be their home and their children’s forever.\n\nThis is the land they sought and found. Every inch of shore that their eyes first set upon, every hill and mountain that beckoned to them with a green-and-purple invitation, every mile of rolling plain that their view encompassed, every river and lake that promised a plentiful living and the fruitfulness of commerce, is a hallowed spot to me.\n\nBy the strength of their hearts and hands, by every right of law, human and divine, this land and all the appurtenances thereof–the black and fertile soil, the seas and lakes and rivers teeming with fish, the forests with their inexhaustible wealth in wild life and timber, the mountains with their bowels swollen with minerals–the whole of this rich and happy land has been, for centuries without number, the land of my fathers. This land I received in trust from them and in trust will pass it to my children, and so on until the world is no more.\n\nI am a Filipino. In my blood runs the immortal seed of heroes–seed that flowered down the centuries in deeds of courage and defiance. In my veins yet pulses the same hot blood that sent Lapulapu to battle against the first invader of this land, that nerved Lakandula in the combat against the alien foe, that drove Diego Silang and Dagohoy into rebellion against the foreign oppressor.\n\nThat seed is immortal. It is the self-same seed that flowered in the heart of Jose Rizal that morning in Bagumbayan when a volley of shots put an end to all that was mortal of him and made his spirit deathless forever, the same that flowered in the hearts of Bonifacio in Balintawak, of Gergorio del Pilar at Tirad Pass, of Antonio Luna at Calumpit; that bloomed in flowers of frustration in the sad heart of Emilio Aguinaldo at Palanan, and yet burst forth royally again in the proud heart of Manuel L. Quezon when he stood at last on the threshold of ancient Malacañan Palace, in the symbolic act of possession and racial vindication.\n\nThe seed I bear within me is an immortal seed. It is the mark of my manhood, the symbol of dignity as a human being. Like the seeds that were once buried in the tomb of Tutankhamen many thousand years ago, it shall grow and flower and bear fruit again. It is the insignia of my race, and my generation is but a stage in the unending search of my people for freedom and happiness.\n\nI am a Filipino, child of the marriage of the East and the West. The East, with its languor and mysticism, its passivity and endurance, was my mother, and my sire was the West that came thundering across the seas with the Cross and Sword and the Machine. I am of the East, an eager participant in its spirit, and in its struggles for liberation from the imperialist yoke. But I also know that the East must awake from its centuried sleep, shake off the lethargy that has bound his limbs, and start moving where destiny awaits.\n\nFor I, too, am of the West, and the vigorous peoples of the West have destroyed forever the peace and quiet that once were ours. I can no longer live, a being apart from those whose world now trembles to the roar of bomb and cannon-shot. I cannot say of a matter of universal life-and-death, of freedom and slavery for all mankind, that it concerns me not. For no man and no nation is an island, but a part of the main, there is no longer any East and West–only individuals and nations making those momentous choices which are the hinges upon which history resolves.\n\nAt the vanguard of progress in this part of the world I stand–a forlorn figure in the eyes of some, but not one defeated and lost. For, through the thick, interlacing branches of habit and custom above me, I have seen the light of the sun, and I know that it is good. I have seen the light of justice and equality and freedom, my heart has been lifted by the vision of democracy, and I shall not rest until my land and my people shall have been blessed by these, beyond the power of any man or nation to subvert or destroy.\n\nI am a Filipino, and this is my inheritance. What pledge shall I give that I may prove worthy of my inheritance? I shall give the pledge that has come ringing down the corridors of the centuries, and it shall be compounded of the joyous cries of my Malayan forebears when first they saw the contours of this land loom before their eyes, of the battle cries that have resounded in every field of combat from Mactan to Tirad Pass, of the voices of my people when they sing:\n\nLand of the morning,\nChild of the sun returning–\nNe’er shall invaders\nTrample thy sacred shore.\n\nOut of the lush green of these seven thousand isles, out of the heartstrings of sixteen million people all vibrating to one song, I shall weave the mighty fabric of my pledge. Out of the songs of the farmers at sunrise when they go to labor in the fields, out of the sweat of the hard-bitten pioneers in Mal-lig and Koronadal, out of the silent endurance of stevedores at the piers and the ominous grumbling of peasants in Pampanga, out of the first cries of babies newly born and the lullabies that mothers sing, out of the crashing of gears and the whine of turbines in the factories, out of the crunch of plough-shares upturning the earth, out of the limitless patience of teachers in the classrooms and doctors in the clinics, out of the tramp of soldiers marching, I shall make the pattern of my pledge:\n\n“I am a Filipino born to freedom, and I shall not rest until freedom shall have been added unto my inheritance—for myself and my children and my children’s children—forever.”",
      "keywords": "philippines filipino nationalism freedom",
      "date": "1941-08-16"
    },
    {
      "author": "Steve Jobs",
      "speech": "I am honored to be with you today at your commencement from one of the finest\nuniversities in the world. I never graduated from college. Truth be told, this is the closest\nI've ever gotten to a college graduation. Today I want to tell you.. a story.. from my life.\nThat's it. No big deal….\nMy story is about death.\nWhen I was 17, I read a quote that went something like: \"If you live each day as if it was\nyour last, someday you'll most certainly be right.\" It made an impression on me, and\nsince then, for the past 33 years, I have looked in the mirror every morning and asked\nmyself: \"If today were the last day of my life, would I want to do what I am about to do\ntoday?\" And whenever the answer has been \"No\" for too many days in a row, I know I\nneed to change something.\nRemembering that I'll be dead soon is the most important tool I've ever encountered to\nhelp me make the big choices in life. Because almost everything — all external\nexpectations, all pride, all fear of embarrassment or failure - these things just fall away\nin the face of death, leaving only what is truly important. Remembering that you are\ngoing to die is the best way I know to avoid the trap of thinking you have something to\nlose. You are already naked. There is no reason not to follow your heart.\nAbout a year ago I was diagnosed with cancer. I had a scan at 7:30 in the morning, and\nit clearly showed a tumor on my pancreas. I didn't even know what a pancreas was. The\ndoctors told me this was almost certainly a type of cancer that is incurable, and that I\nshould expect to live no longer than three to six months. My doctor advised me to go\nhome and get my affairs in order, which is doctor's code for prepare to die. It means to\ntry to tell your kids everything you thought you'd have the next 10 years to tell them in\njust a few months. It means to make sure everything is buttoned up so that it will be as\neasy as possible for your family. It means to say your goodbyes.\nI lived with that diagnosis all day. Later that evening I had a biopsy, where they stuck an\nendoscope down my throat, through my stomach and into my intestines, put a needle\ninto my pancreas and got a few cells from the tumor. I was sedated, but my wife, who\nwas there, told me that when they viewed the cells under a microscope the doctors\nstarted crying because it turned out to be a very rare form of pancreatic cancer that is\ncurable with surgery. I had the surgery and I'm fine now.\nThis was the closest I've been to facing death, and I hope it's the closest I get for a few\nmore decades. Having lived through it, I can now say this to you with a bit more\ncertainty than when death was a useful but purely intellectual concept:\nNo one wants to die. Even people who want to go to heaven don't want to die to get\nthere. And yet death is the destination we all share. No one has ever escaped it. And\nthat is as it should be, because Death is very likely the single best invention of Life. It is\nLife's change agent. It clears out the old to make way for the new. Right now the new is\nyou, but someday not too long from now, you will gradually become the old and be\ncleared away. Sorry to be so dramatic, but it is quite true.\nYour time is limited, so don't waste it living someone else's life. Don't be trapped by\ndogma — which is living with the results of other people's thinking. Don't let the noise of\nothers' opinions drown out your own inner voice. And most important, have the courage\nto follow your heart and intuition. They somehow already know what you truly want to\nbecome. Everything else is secondary.\nWhen I was young, there was an amazing publication called The Whole Earth Catalog,\nwhich was one of the bibles of my generation. It was created by a fellow named Stewart\nBrand not far from here in Menlo Park, and he brought it to life with his poetic touch.\nThis was in the late 1960's, before personal computers and desktop publishing, so it\nwas all made with typewriters, scissors, and polaroid cameras. It was sort of like Google\nin paperback form, 35 years before Google came along: it was idealistic, and\noverflowing with neat tools and great notions.\nStewart and his team put out several issues of The Whole Earth Catalog, and then\nwhen it had run its course, they put out a final issue. It was the mid-1970s, and I was\nyour age. On the back cover of their final issue was a photograph of an early morning\ncountry road, the kind you might find yourself hitchhiking on if you were so adventurous.\nBeneath it were the words: \"Stay Hungry. Stay Foolish.\" It was their farewell message\nas they signed off. Stay Hungry. Stay Foolish. And I have always wished that for myself.\nAnd now, as you graduate to begin anew, I wish that for you.\nStay Hungry. Stay Foolish.\nThank you all very much.",
      "keywords": "love death success intuition",
      "date": "2005-12-06"
    },
    {
      "author": "You",
      "speech":"test",
      "keywords": "america philippines",
      "date": "2023-22-10T17:50:50"
    }
  ]
}